api3.2/app/controllers/user_event_confirmations_controller.rb

SELECT `user_events`.* FROM `user_events` WHERE `user_events`.`token` = 'ero1ddbv-c1bgFt9' LIMIT 1
INSERT INTO `user_event_confirmations` (`address`, `cellnumber`, `cep`, `city`, `complement`, `created_at`, `email_usage`, `function`, `image_usage`, `number`, `qr_path`, `qr_sent_at`, `report_csv`, `smartphone`, `sms_usage`, `state`, `updated_at`, `user_event_id`) VALUES (NULL, NULL, NULL, NULL, NULL, '2013-10-03 19:51:23', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2013-10-03 19:51:23', 6)
UPDATE `user_event_confirmations` SET `qr_path` = '/var/apps/distribuidor_2.0/api3.2/public/qrcodes/d7dafa20e0b6487855fe05de.jpeg', `qr_sent_at` = '2013-10-03 19:54:59', `updated_at` = '2013-10-03 19:54:59' WHERE `user_event_confirmations`.`id` = 2
UPDATE `user_events` SET `presence` = 1, `updated_at` = '2013-10-03 19:50:39' WHERE `user_events`.`id` = 6
UPDATE `users` SET `is_smartphone` = 1, `image_usage` = 1, `sms_usage` = 1, `email_usage` = 1, `position` = 'meu cargo', `address` = 'meu endereó', `address_number` = '2222222222', `complement` = 'c', `cep` = '11111-111', `state` = 'c', `city` = 'c', `celnumber` = '(22) 22222-2222', `updated_at` = '2013-10-03 19:51:24' WHERE `users`.`id` = 3
---
  def create
    @user_event = UserEvent.find_by_token params[:user_event_confirmation][:token] rescue nil
    if @user_event
      UserEvent.transaction do
        params[:user_event_confirmation].delete(:token)
        @user_event.build_user_event_confirmation(params[:user_event_confirmation])

        if @user_event.confirm and @user_event.save

SELECT `user_events`.* FROM `user_events` WHERE `user_events`.`token` = 'ero1ddbv-c1bgFt9' LIMIT 1
---
  def show
    @user_event = UserEvent.find_by_token(params[:id]) rescue nil